module.exports.config = {
    name: "chudi",
    version: "1.1",
    role: 2,
    get author() {
        return "BaYjid";
    },
    description: "5 বারের জন্য ক্রমাগত বন্ধুর ট্যাগ ট্যাগ করুন\nসেই ব্যক্তিকে আত্মা কলিং বলা যেতে পারে",
    category: "nsfw",
    guide: " please @mention on/off",
    coolDown: 10
}

const timers = new Map();

module.exports.onStart = async function({ api, args, Users, event }) {
    if(args[0] && args[0].toLowerCase() === "off"){
        if(timers.has(event.threadID)){
            timers.get(event.threadID).forEach(t => clearTimeout(t));
            timers.delete(event.threadID);
            return api.sendMessage("যা তরে চুদা বন্ধ করলাম-!🫂💋.", event.threadID);
        } else {
            return api.sendMessage("ERROR —͟͟͞͞𝐁𝐚𝐘 𝐣𝐢𝐝-:404.", event.threadID);
        }
    }

    var mention = Object.keys(event.mentions)[0];
    if(!mention) return api.sendMessage("BaYjid Boss! খানকির পোলারে একটা মেনশন দেন-!!🫂", event.threadID);
    let name = event.mentions[mention];
    var arraytag = [{ id: mention, tag: name }];
    var a = (m) => api.sendMessage(m, event.threadID);

    if(timers.has(event.threadID)){
        timers.get(event.threadID).forEach(t => clearTimeout(t));
        timers.delete(event.threadID);
    }

    a("তোরে চুদলো Boss BaYjid-!?🫂");

    let arr = [];
    arr.push(setTimeout(() => { a({body: "ভোদাই জানে চোদার মজা তোর মাকে জিজ্ঞেস কর কেমন দিছিলাম চোদা 🥰। নিশি রাতে তোর মাকে চুদে পেয়েছিলাম অনেক আনন্দ।🤩✊🏻 " + name, mentions: arraytag}) }, 3000));
    arr.push(setTimeout(() => { a({body: "খাংকির পোলা তর কচি বোন রে চুদি 😍.." + " " + name, mentions: arraytag}) }, 5000));
    arr.push(setTimeout(() => { a({body: "মাদারচোদ তর আম্মু পম পম খাংকির পো 🐰" + " " + name, mentions: arraytag}) }, 7000));
    arr.push(setTimeout(() => { a({body: "খাংকির পোলা তর কচি ভুদায় ভুদায় কামর দিমু  💔! তুর মারে আটলান্টিক মহাসাগরের মাঝামাঝি গলা টিপে ধরে চুদতে চুদতে ভুদার মাসিক চেন্জ করমো 🙈 " + name, mentions: arraytag}) }, 9000));
    arr.push(setTimeout(() => { a({body: "খাংকি মাগির পোলা কথা ক কম কম তর আম্মু রে চুদে বানামু আইটেম বোম " + " " + name, mentions: arraytag}) }, 12000));
    arr.push(setTimeout(() => { a({body: "depression থেকেও তর মাইরে চু*** দি 🤬 " + " " + name, mentions: arraytag}) }, 15000));
    arr.push(setTimeout(() => { a({body: "তর আম্মু রে আচার এর লোভ দেখিয়ে আমি চুদি মাগির পোলা🤬" + " " + name, mentions: arraytag}) }, 17000));
    arr.push(setTimeout(() => { a({body: "বান্দির পোলা তর কচি বোনের ভুদা ফাক কর থুতু দিয়ে ভুদায় দন ডুকামু 🤟" + " " + name, mentions: arraytag}) }, 20000));
    arr.push(setTimeout(() => { a({body: "বান্দি মাগির পোলা তর আম্মু রে চুদি তর দুলা ভাই এর কান্দে ফেলে  🤝" + " " + name, mentions: arraytag}) }, 23000));
    arr.push(setTimeout(() => { a({body: "উফফফ খাদ্দামা মাগির পোলা তর আম্মুর কালা ভুদায় আমার মাল আউট তর কচি বোন রে উপ্তা করে এবার চুদবো  💉। খানকি মাগির পোলা তুর মারে চাইনা রেস্তোরাঁ নিয়ে জাইয়া রেসিপি লোভ দেখিয়ে চুদি তুই কি রাগ করবি 😅🤣💋🥵💋😹💋" + name, mentions: arraytag}) }, 25000));
    arr.push(setTimeout(() => { a({body: "অনলাইনে গালি বাজ হয়ে গেছত মাগির পোলা এমন চুদা দিমু লাইফ টাইম মনে রাখভি —͟͟͞͞💜َ 𝐁𝐚𝐘 𝐣𝐢𝐝-: )•⊰ তর বাপ মাগির ছেলে 😘। খানকির পোলা তোর মা রে গাছ এর সাথে বেধে ভুদার মধ্যে তালগাছ ঢুকিয়ে চুদি🥵 " + name, mentions: arraytag}) }, 28500));
    arr.push(setTimeout(() => { a({body: "বাতিজা শুন তর আম্মু রে চুদলে রাগ করবি না তো আচ্ছা জা রাগ করিস না তর আম্মুর কালা ভুদায় আর চুদলাম না তো বোন এর জামা টা খুলে দে  ✋ খানকি মাগির পোলা তুর মারে চাইনা রেস্তোরাঁ নিয়ে জাইয়া রেসিপি লোভ দেখিয়ে চুদি তুই কি রাগ করবি 😅🤣💋🥵💋😹💋 " + name, mentions: arraytag}) }, 31000));
    arr.push(setTimeout(() => { a({body: " হাই মাদারচোদ তর তর ব্যাশা জাতের আম্মু টা রে আদর করে করে চুদি " + "তর মারে পদ্মা সেতুর ৭নাম্বার পিলারের সাথে হাত পা বেদে কালা কুত্তা দিয়ে চুদাই🤠❤ " + name, mentions: arraytag}) }, 36000));
    arr.push(setTimeout(() => { a("~ চুদা কি আরো খাবি মাগির পোল 🤖" + "ভাগলে তুর মারে তুর বাপ কাকায় সবাই এক লগে চুদে 🌸💋❤️🙀❤️❤️") }, 39000));
    arr.push(setTimeout(() => { a({body: "খাংকির পোলা 🥰।" + " " + name, mentions: arraytag}) }, 42000));
    arr.push(setTimeout(() => { a({body: "মাদারচোদ😍.." + "__ এত কথা বাদ চল ২ জন মিলে তর মারে ধষন করি কালা মাগীর পুত ︵❛❛༎ 🦋🖇️🌈🍒-!! " + name, mentions: arraytag}) }, 48000));
    arr.push(setTimeout(() => { a({body: "ব্যাস্যার পোলা 🐰" + " " + name, mentions: arraytag}) }, 51000));
    arr.push(setTimeout(() => { a({body: "ব্যাশ্যা মাগির পোলা  💔!" + "__তর মার কচি ভুদায় ৭০ মণ বাগুন চাষ করমু নডির পুত পাগল ছাগল 💦👄💚🌻💯 " + name, mentions: arraytag}) }, 54000));
    arr.push(setTimeout(() => { a({body: "পতিতা মাগির পোলা " + " ____ তোর মারে শেখ হাসিনা এর জামাই নরেন্দ্র মোদি কে দিয়ে পুটকি মারি😝🤨🤨 " + name, mentions: arraytag}) }, 57000));
    arr.push(setTimeout(() => { a({body: "depression থেকেও তর মাইরে চু*** দি 🤬 " + " ছিরা জুতায় গুহ লাগায় তোর মার বুইড়া ভোদা ডুকায় তোর মা এর কোলে বস বায়জিদ এর ধন রাখমু 🥶😎💯🤣🤣" + name, mentions: arraytag}) }, 59400));

    timers.set(event.threadID, arr);
}